package leetcode;

public class ClimbStairs {
    public int climbStairs(int n) {
        // 2 = (1+1) (2+0)
        //3 = (1+1+1) (1+2) (2+1)
        //3 = (1+1+1), (1+2) (2+1)
        //4 == (1+1+1+1) (1+2+1) (1+1+2) (2+1+1) (2+2)
        //5 == (1+1+1+2), (1+2+2) (2+1+2) (1+1+1+1+1) (1+2+1+1), (1+1+2+1)  (2+1+1+1) (2+2+1)(2가2개 있고 1이 1개일때, 방법 )

        int[] dp = new int[46];
        dp[1] = 1;
        dp[2] = 2;
        for (int i=3; i<=45; i++) {
            dp[i] = dp[i-2] + dp[i-1];
        }
        return dp[n];
    }
}
